Revit 2027 API
LightType.DimmingColor Property
 The dimming temperature value in Kelvins.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LightDimmingColor DimmingColor { get; set; }
Public Property DimmingColor As LightDimmingColor
	Get
	Set
public:
property LightDimmingColor DimmingColor {
	LightDimmingColor get ();
	void set (LightDimmingColor value);
}
member DimmingColor : LightDimmingColor with get, set
Property Value
LightDimmingColor
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
LightType Class
Autodesk.Revit.DB.Lighting Namespace